import cflw网络连接 as 连接
import cflw网络设备 as 设备
import cflw网络设备_思科 as 思科
def main():
	v连接 = 连接.C网络终端("gns3.localhost", 5000)
	v设备 = 思科.f创建设备(v连接, 思科.E型号.c7200, 15.2)
	v用户模式 = v设备.f模式_用户()
	v用户模式.f登录()
	v设备.fs回显(True)
	v全局配置 = v用户模式.f模式_全局配置()
	v访问列表 = v全局配置.f模式_访问控制列表("acl0", 设备.E访问控制列表类型.e扩展6)
	v访问列表.fs规则(None, 设备.S访问控制列表规则(a允许 = True, a协议 = 设备.E协议.ipv6, a源地址 = "1::1/64", a目的地址 = "2::2/64"))
	v访问列表.fs规则(None, 设备.S访问控制列表规则(a允许 = True, a协议 = 设备.E协议.tcp, a目的端口 = 设备.S端口号.fc等于(445)))
	v访问列表.fs规则(1, 设备.S访问控制列表规则(a允许 = True, a协议 = 设备.E协议.udp, a源地址 = "1234::1234/128", a源端口 = "<=999", a目的端口 = "[1000,10000)"))
if __name__ == "__main__":
	main()